# Regression Exercises

In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import env
import wrangle

from sklearn.model_selection import train_test_split

#### As a customer analyst for Telco, you want to know who has spent the most money with the company over their lifetime. You have monthly charges and tenure, so you think you will be able to use those two attributes as features to estimate total charges. You need to do this within an average of $5.00 per customer.

#### In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Telco data from the telco_churn database in the Codeup database server.

1. Acquire customer_id, monthly_charges, tenure, and total_charges from the telco_churn database for all customers with a 2-year contract.
2. Using your acquired Telco data, walk through the summarization and cleaning steps in your wrangle.ipynb file like we did above. You may handle the missing values however you feel is appropriate and meaningful; remember to document your process and decisions using markdown and code commenting where helpful.
3. End with a wrangle.py file that contains the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe with no missing values. Name your final function wrangle_telco.

In [2]:
# acquire my data
df = wrangle.get_telco_data()

In [3]:
df.sample(5)

,payment_type_id,payment_type,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,internet_service_type_id,internet_service_type,contract_type_id,contract_type
4763,3,Bank transfer (automatic),6919-ELBGL,Male,1,Yes,Yes,72,Yes,Yes,...,3,Yes,3,114.95,8196.4,No,2,Fiber optic,3,Two year
4037,3,Bank transfer (automatic),1680-VDCWW,Male,0,Yes,No,12,Yes,No,...,2,No,3,19.80,202.25,No,3,None,2,One year
2630,2,Mailed check,3594-IVHJZ,Female,0,No,No,2,Yes,No,...,1,Yes,2,20.45,42.45,No,3,None,1,Month-to-month
2487,2,Mailed check,1755-FZQEC,Male,0,No,No,39,Yes,No,...,2,No,2,19.90,791.15,No,3,None,2,One year
6758,4,Credit card (automatic),5387-ASZNZ,Female,1,No,No,66,Yes,Yes,...,2,Yes,4,63.85,4174.35,No,1,DSL,2,One year

In [4]:
# pull customers with a 2 year contract
df = df[df['contract_type']=='Two year']

In [5]:
# recreate my dataframe with only the specified columns
column = ['customer_id', 'monthly_charges', 'tenure', 'total_charges']
df = df[column]

In [6]:
df.head(3)

   customer_id  monthly_charges  tenure total_charges
2   0057-QBUQH            25.10      43       1070.15
7   0608-JDVEC            19.80      50        1013.2
35  3239-TPHPZ            20.05      12        264.55

In [7]:
df.shape

(1695, 4)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1695 entries, 2 to 7040
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer_id      1695 non-null   object
 1   monthly_charges  1695 non-null   float64
 2   tenure           1695 non-null   int64
 3   total_charges    1695 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 66.2+ KB

In [9]:
df.isnull().any()

customer_id        False
monthly_charges    False
tenure             False
total_charges      False
dtype: bool

In [10]:
# address the nulls in total charges

In [11]:
# replace whitespace with a NaN value
df = df.replace(r'^\s*$', np.nan, regex=True)

In [12]:
# now we can see our nulls
df.isnull().any()

customer_id        False
monthly_charges    False
tenure             False
total_charges       True
dtype: bool

In [13]:
# how many nulls?
df.isnull().sum()

customer_id         0
monthly_charges     0
tenure              0
total_charges      10
dtype: int64

In [14]:
# let's just drop the nulls since it's only 10
df = df.dropna()

In [15]:
df.shape

(1685, 4)

In [16]:
# change our total_charges column to a float
df.total_charges = df.total_charges.astype('float')

In [17]:
df.head()

   customer_id  monthly_charges  tenure  total_charges
2   0057-QBUQH            25.10      43        1070.15
7   0608-JDVEC            19.80      50        1013.20
35  3239-TPHPZ            20.05      12         264.55
43  3812-LRZIR            24.50      27         761.95
50  4475-NVTLU            19.20      45         903.70

In [18]:
df.dtypes

customer_id         object
monthly_charges    float64
tenure               int64
total_charges      float64
dtype: object

In [19]:
df.describe()

       monthly_charges      tenure  total_charges
count      1685.000000  1685.00000    1685.000000
mean         60.872374    57.07181    3728.933947
std          34.712210    17.72913    2571.252806
min          18.400000     1.00000      20.350000
25%          24.050000    48.00000    1278.800000
50%          64.450000    64.00000    3623.950000
75%          90.550000    71.00000    5999.850000
max         118.750000    72.00000    8672.450000

### Rerun everything to be sure our functions work.

In [20]:
df = wrangle.get_telco_data()

In [21]:
df.head()

,payment_type_id,payment_type,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,...,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn,internet_service_type_id,internet_service_type,contract_type_id,contract_type
0,2,Mailed check,0030-FNXPP,Female,0,No,No,3,Yes,No,...,1,No,2,19.85,57.2,No,3,None,1,Month-to-month
1,2,Mailed check,0031-PVLZI,Female,0,Yes,Yes,4,Yes,No,...,1,No,2,20.35,76.35,Yes,3,None,1,Month-to-month
2,1,Electronic check,0098-BOWSO,Male,0,No,No,27,Yes,No,...,1,Yes,1,19.40,529.8,No,3,None,1,Month-to-month
3,1,Electronic check,0107-WESLM,Male,0,No,No,1,Yes,No,...,1,Yes,1,19.85,19.85,Yes,3,None,1,Month-to-month
4,3,Bank transfer (automatic),0114-RSRRW,Female,0,Yes,No,10,Yes,No,...,1,Yes,3,19.95,187.75,No,3,None,1,Month-to-month

In [22]:
df = wrangle.prep_telco(df)

In [23]:
df.head()

     customer_id  monthly_charges  tenure  total_charges
5348  0040-HALCW             20.4      54        1090.60
5349  0042-RLHYP             19.7      69        1396.90
5350  0057-QBUQH             25.1      43        1070.15
5351  0064-SUDOG             20.3      12         224.50
5352  0071-NDAFP             25.5      25         630.60

In [24]:
train, validate, test = wrangle.telco_split(df)

In [25]:
train.shape, validate.shape, test.shape

((943, 4), (405, 4), (337, 4))

### Exercises - Challenge
##### Let's set up an example scenario as perspective for our regression exercises using the Zillow dataset.

##### As a Codeup data science graduate, you want to show off your skills to the Zillow data science team in hopes of getting an interview for a position you saw pop up on LinkedIn. You thought it might look impressive to build an end-to-end project in which you use some of their Kaggle data to predict property values using some of their available features; who knows, you might even do some feature engineering to blow them away. Your goal is to predict the values of single unit properties using the obervations from 2017.

##### In these exercises, you will complete the first step toward the above goal: acquire and prepare the necessary Zillow data from the zillow database in the Codeup database server.

1. Acquire bedroomcnt, bathroomcnt, calculatedfinishedsquarefeet, taxvaluedollarcnt, yearbuilt, taxamount, and fips from the zillow database for all 'Single Family Residential' properties.
2. Using your acquired Zillow data, walk through the summarization and cleaning steps in your wrangle.ipynb file like we did above. You may handle the missing values however you feel is appropriate and meaninful; remember to document your process and decisions using markdown and code commenting where helpful.
3. Store all of the necessary functions to automate your process from acquiring the data to returning a cleaned dataframe witn no missing values in your wrangle.py file. Name your final function wrangle_zillow.

In [26]:
# use the function I created to bring in my zillow dataframe
zillow = wrangle.get_zillow()

In [27]:
zillow.head()

,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,0.0,NaN,27516.0,NaN,NaN,6037.0
1,0.0,NaN,10.0,NaN,NaN,6037.0
2,0.0,NaN,10.0,NaN,NaN,6037.0
3,0.0,NaN,2108.0,NaN,174.21,6037.0
4,2.0,3633.0,296425.0,2005.0,6941.39,6037.0

In [29]:
# take a look at the column types
zillow.dtypes

bathroomcnt                     float64
calculatedfinishedsquarefeet    float64
taxvaluedollarcnt               float64
yearbuilt                       float64
taxamount                       float64
fips                            float64
dtype: object

In [31]:
zillow.describe().T

,count,mean,std,min,25%,50%,75%,max
bathroomcnt,2152852.0,2.230688,0.999280,0.00,2.00,2.00,3.00,32.00
calculatedfinishedsquarefeet,2144379.0,1862.855178,1222.125124,1.00,1257.00,1623.00,2208.00,952576.00
taxvaluedollarcnt,2152370.0,461896.237963,699676.049600,1.00,188170.25,327671.00,534527.00,98428909.00
yearbuilt,2143526.0,1960.949681,22.162196,1801.00,1949.00,1958.00,1976.00,2016.00
taxamount,2148421.0,5634.865978,8178.910249,1.85,2534.98,4108.95,6414.32,1337755.86
fips,2152863.0,6048.377335,20.433292,6037.00,6037.00,6037.00,6059.00,6111.00

In [32]:
# assess the nulls
zillow.isnull().sum()

bathroomcnt                       11
calculatedfinishedsquarefeet    8484
taxvaluedollarcnt                493
yearbuilt                       9337
taxamount                       4442
fips                               0
dtype: int64

In [35]:
zillow.shape

(2152863, 6)

In [36]:
# let's drop these nulls! since they don't even account for 1% of the data
zillow.dropna(inplace=True)

In [37]:
zillow.shape

(2140235, 6)

In [38]:
zillow.isnull().any()

bathroomcnt                     False
calculatedfinishedsquarefeet    False
taxvaluedollarcnt               False
yearbuilt                       False
taxamount                       False
fips                            False
dtype: bool

In [39]:
zillow.head()

,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
4,2.0,3633.0,296425.0,2005.0,6941.39,6037.0
6,4.0,1620.0,847770.0,2011.0,10244.94,6037.0
7,2.0,2077.0,646760.0,1926.0,7924.68,6037.0
11,0.0,1200.0,5328.0,1972.0,91.60,6037.0
14,0.0,171.0,6920.0,1973.0,255.17,6037.0

In [40]:
zillow = zillow.reset_index()

In [41]:
zillow.head()

,index,bathroomcnt,calculatedfinishedsquarefeet,taxvaluedollarcnt,yearbuilt,taxamount,fips
0,4,2.0,3633.0,296425.0,2005.0,6941.39,6037.0
1,6,4.0,1620.0,847770.0,2011.0,10244.94,6037.0
2,7,2.0,2077.0,646760.0,1926.0,7924.68,6037.0
3,11,0.0,1200.0,5328.0,1972.0,91.60,6037.0
4,14,0.0,171.0,6920.0,1973.0,255.17,6037.0